#Portada
tituloCover = Sistema de Almacenamiento Masivo
carrera = Ingenieria en Sistemas
facultad = Facultad de Arquitecturas e Ingenierias
univ = Universidad de Pamplona
materia = Plataformas Tecnologicas

#Menu Desplegable
menu_contenido=Contenido
menu_objetivos=Objetivos
menu_tema=Tema
menu_quiz_parte_1=Quiz Parte 1
menu_quiz_parte_2=Quiz Parte 2


#Contenedor Padre
titulo = Sistema de Almacenamiento Masivo

##Contenido - Hijo[0]
tituloCont = Contenido
tema1 = Tema 1: Descripci\u00f3n general de la estructura de almacenamiento masivo
tema2 = Tema 2: Programaci\u00f3n de HDD
tema3 = Tema 3: Programaci\u00f3n NVM
tema4 = Tema 4: Detecci\u00f3n y correcci\u00f3n de errores
tema5 = Tema 5: Gesti\u00f3n de dispositivos de almacenamiento
tema6 = Tema 6: Gesti\u00f3n del espacio de intercambio
tema7 = Tema 7: Accesorio de almacenamiento
tema8 = Tema 8: Estructura RAID 

##Objetivos - Hijo[1]
tituloObjetivos = Objetivos
descripcionObj = La presentaci\u00f3n abordar\u00e1 la descripci\u00f3n de los dispositivos de almacenamiento secundario, detallando sus estructuras f\u00edsicas y c\u00f3mo estas influyen en sus usos y funcionalidades. Se explorar\u00e1n diferentes tipos como discos duros, SSDs o unidades de cinta, destacando sus dise\u00f1os y c\u00f3mo impactan en la velocidad, capacidad y durabilidad. Adem\u00e1s, se analizar\u00e1n las caracter\u00edsticas de rendimiento, algoritmos de E/S y los servicios que los sistemas operativos proporcionan para mejorar el almacenamiento masivo, incluyendo t\u00e9cnicas como RAID para optimizar la redundancia y velocidad de acceso a los datos.

##Topic1 - Hijo[2]
sub1txtTopic1 = Los HDDs funcionan haciendo girar discos recubiertos magn\u00e9ticamente debajo de cabezales de lectura y escritura en movimiento.
sub2txtTopic1 = Los dispositivos de memoria no vol\u00e1til, como los discos de estado s\u00f3lido (SSD), vienen en diversas formas como unidades USB. Aunque suelen ser m\u00e1s confiables que los HDD, tambi\u00e9n son m\u00e1s costosos por MB, pueden tener una vida \u00fatil m\u00e1s corta que requiere un manejo cuidadoso, ofrecen menos capacidad, pero cuentan con un rendimiento significativamente m\u00e1s r\u00e1pidos.
tituloTopic1 = Vision General De la Estructura de Almacenamiento Masivo
txtTopic1 = Las formas primarias de almacenamiento secundario en las computadoras modernas son los discos duros (HDDs) y los dispositivos de memoria no vol\u00e1til (NVM). 

##Topic2 - Hijo[3]
tituloTopic2 = Programacion de HDD
txtTopic2 = El sistema operativo debe optimizar el uso del hardware para garantizar tiempos de acceso r\u00e1pidos y ancho de banda \u00f3ptimo en las unidades de disco. En la programaci\u00f3n de disco, distintas fuentes generan solicitudes de E/S de disco, desde el sistema operativo hasta los procesos del sistema y del usuario. Estas solicitudes incluyen detalles como modo de entrada/salida, direcci\u00f3n del disco, direcci\u00f3n de memoria y sectores a transferir. En el pasado, el sistema operativo se encargaba de la gesti\u00f3n de colas y la programaci\u00f3n de la cabeza del disco, pero ahora estas tareas son responsabilidad de dispositivos de almacenamiento y controladores.
subTituTopic2 = Algoritmos de programaci\u00f3n del disco:
sub1TxtTopic2 = El algoritmo SCAN, conocido como algoritmo del elevador, gestiona las solicitudes de disco al mover el brazo del disco de un extremo al otro, atendiendo las solicitudes en su trayecto. Sin embargo, las solicitudes concentradas en el extremo opuesto al inicio del movimiento del brazo pueden experimentar mayores tiempos de espera si est\u00e1n distribuidas desigualmente a lo largo del disco.
sub2txtTopic2 = Ofrece tiempos de espera m\u00e1s consistentes que SCAN. As\u00ed es c\u00f3mo funciona: el cabezal se desplaza de un extremo al otro del disco, atendiendo solicitudes en el camino. Una vez que llega al final, regresa r\u00e1pidamente al inicio del disco sin atender solicitudes en el viaje de retorno. Considera los cilindros como una lista circular, que se mueve del \u00faltimo cilindro al primero.

##Topic3 - Hijo[4]
tituloTopic3 = Programacion de NVM
txtTopic3 = En RHEL 7 se emplea el m\u00e9todo NOOP (sin programaci\u00f3n), consolidando las solicitudes adyacentes de Direcci\u00f3n L\u00f3gica de Bloque (LBA), eliminando cabezas de disco o latencia rotacional. La memoria no vol\u00e1til (NVM) destaca en E/S aleatorias, mientras que los discos duros (HDD) tienen un mejor rendimiento en tareas secuenciales. Ambos muestran un rendimiento comparable. La NVM produce significativamente m\u00e1s Operaciones de Entrada/Salida por Segundo (IOPS) que los HDD (cientos de miles frente a cientos). Sin embargo, la ventaja en el rendimiento de NVM puede disminuir debido a la amplificaci\u00f3n de escritura, donde un solo escriba desencadena recolecci\u00f3n de basura y numerosas lecturas/escrituras, afectando la eficiencia general.

##Topic4 - Hijo[5]
tituloTopic4 = Detecci\u00f3n y Correcci\u00f3n de errores
sub1TxtTopic4 = La detecci\u00f3n de errores es fundamental en diversos aspectos inform\u00e1ticos como memoria, redes y almacenamiento.  
sub2TxtTopic4 = Determina si ha ocurrido un problema, como la inversi\u00f3n de un bit, pudiendo detener operaciones al detectarlo. 
sub3TxtTopic4 = Un m\u00e9todo, utilizando un bit de paridad, verifica errores empleando aritm\u00e9tica modular para calcular, almacenar y comparar valores en palabras de longitud fija.
sub4TxtTopic4 = Otra t\u00e9cnica com\u00fan de detecci\u00f3n de errores, especialmente en redes, es el chequeo de redundancia c\u00edclica (CRC), utilizando una funci\u00f3n hash para identificar errores de m\u00faltiples bits. Sin embargo, el c\u00f3digo de correcci\u00f3n de errores (ECC) va m\u00e1s all\u00e1 de la mera detecci\u00f3n; puede corregir ciertos errores. Los errores suaves son corregibles, mientras que los errores duros solo se identifican, pero no se corrigen.

##Topic5 - Hijo[6]
tituloTopic5 = Gestor de Dispositivos de Almacenamiento
txtTopic5 = Para que el disco pueda almacenar archivos, el sistema operativo necesita establecer sus propias estructuras de datos en el disco. Este formateo l\u00f3gico, tambi\u00e9n conocido como "crear un sistema de archivos", es esencial para la gesti\u00f3n de archivos. La partici\u00f3n ra\u00edz generalmente alberga el sistema operativo, mientras que otras particiones pueden contener sistemas operativos adicionales, sistemas de archivos o permanecer en estado crudo. Tras completarse con \u00e9xito, el sistema de archivos se a\u00f1ade a la tabla de montajes, permitiendo el acceso. El bloque de arranque contiene informaci\u00f3n esencial que dirige al volumen de arranque o a un conjunto de bloques que contienen c\u00f3digo para cargar el n\u00facleo desde el sistema de archivos. Para aplicaciones que requieren gesti\u00f3n directa de bloques, omitiendo al sistema operativo, se dispone de acceso directo al disco crudo. Durante la inicializaci\u00f3n del sistema, el programa de inicio almacenado en la memoria de solo lectura inicia el sistema. El programa cargador de inicio reside en los bloques de inicio de la partici\u00f3n de arranque, orquestando el inicio del sistema.

##Topic6 - Hijo[7]
tituloTopic6 = Gesti\u00f3n de Espacio de Intercambio
txtTopic6 = Utilizado para transferir procesos completos (intercambio) o p\u00e1ginas (paginaci\u00f3n) desde la RAM a un almacenamiento secundario cuando la capacidad de la RAM no es suficiente para todos los procesos. El sistema operativo se encarga de la gesti\u00f3n del espacio de intercambio. El almacenamiento secundario es m\u00e1s lento que la RAM, por lo que optimizar el rendimiento se vuelve crucial. A menudo, es posible tener varios espacios de intercambio, lo que reduce la carga de E/S en dispositivos individuales. Es preferible usar dispositivos dedicados, que pueden estar en particiones en crudo o archivos dentro de un sistema de archivos para facilitar su a\u00f1adido.

##Topic7 - Hijo[8]
tituloTopic7 = Conexi\u00f3n de Almacenamiento
sub1TxtTopic7 = Las computadoras acceden al almacenamiento de tres formas principales: host-attached (adjunto al host), network-attached (adjunto a la red) y en la nube.  
sub2TxtTopic7 = El acceso adjunto al host implica puertos locales de E/S y utiliza diversas tecnolog\u00edas. Buses de almacenamiento como USB, firewire y thunderbolt se utilizan para conectar m\u00faltiples dispositivos, mientras que los sistemas de gama alta suelen emplear canal de fibra (FC). El FC es una arquitectura serial de alta velocidad que utiliza cables de fibra o cobre, permitiendo que m\u00faltiples hosts y dispositivos de almacenamiento se conecten a la infraestructura de FC.
sub3TxtTopic7 = El almacenamiento conectado a la red (NAS, por sus siglas en ingl\u00e9s) ofrece acceso al almacenamiento a trav\u00e9s de una red en lugar de una conexi\u00f3n local, como un bus. Implica la conexi\u00f3n remota a sistemas de archivos, com\u00fanmente utilizando protocolos como NFS y CIFS. Este acceso se facilita a trav\u00e9s de llamadas a procedimientos remotos (RPC, por sus siglas en ingl\u00e9s) entre hosts y almacenamiento, normalmente utilizando TCP o UDP en una red IP. 

##Topic8 - Hijo[9]
tituloTopic8 = Estructura de RAID
sub1TxtTopic8 = RAID, que significa Conjunto Redundante de Discos Econ\u00f3micos, involucra m\u00faltiples unidades de disco que aumentan la confiabilidad mediante la redundancia, incrementando as\u00ed el tiempo medio hasta la falla. Esta configuraci\u00f3n considera el tiempo medio de reparaci\u00f3n y el tiempo de exposici\u00f3n durante el cual otra falla podr\u00eda provocar la p\u00e9rdida de datos, calculando el tiempo medio hasta la p\u00e9rdida de datos basado en estos factores. RAID a menudo se combina con NVRAM (Memoria de Acceso Aleatorio No Vol\u00e1til) para mejorar el rendimiento de escritura. Varias t\u00e9cnicas de uso de disco involucran a m\u00faltiples discos trabajando en conjunto. Por ejemplo, el rayado de disco utiliza un grupo de discos como una sola unidad de almacenamiento
sub2TxtTopic8 = RAID se puede organizar en seis niveles diferentes. Estos esquemas mejoran el rendimiento y la confiabilidad del sistema de almacenamiento al almacenar datos redundantes. Los niveles de RAID incluyen espejado o sombreado (RAID 1), que duplica cada disco, y configuraciones como espejos rayados (RAID 1+0) o rayas espejadas (RAID 0+1), ofreciendo alto rendimiento y confiabilidad. El paridad entrelazada en bloques (RAID 4, 5, 6) utiliza significativamente menos redundancia. Sin embargo, es importante tener en cuenta que RAID dentro de un conjunto de almacenamiento a\u00fan puede fallar si el conjunto en s\u00ed mismo falla. Para mitigar este riesgo, la replicaci\u00f3n autom\u00e1tica de datos entre conjuntos es una pr\u00e1ctica com\u00fan. Adem\u00e1s, a menudo se dejan algunos discos de repuesto en caliente sin asignar, reemplazando autom\u00e1ticamente un disco fallido y reconstruyendo los datos en ellos.